Revit 2027 API
View.AllowsAnalysisDisplay Method
 Identifies if this view allows display of Analysis results.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowsAnalysisDisplay()
Public Function AllowsAnalysisDisplay As Boolean
public:
bool AllowsAnalysisDisplay()
member AllowsAnalysisDisplay : unit -> bool
Return Value
Boolean
 True if the view allows display of Analysis results, false otherwise.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace